<?php

$lan = array(
  'List Bounce Rules' => 'نمایش فانونهای برگشت',
  'rulesexistwarning' => 'شما از پیش قانونهای برگشت را در سیستم تعریف کرده اید. 
    هنگام ساختن قانونهای جدید مراقب باشید با قانونهای موجود اختلال نداشته باشد.',
  'norulesyet' => 'شما قانونی تعریف نکرده اید. 
    میتوانید "ساختن قانونهای برگشت" را کلیک کنید تا از برگشتیهای موجود به صورت خودکار قانون ساخته شود. 
    این عمل تعداد زیادی قانون میسازد که باید بازبینی و فعال شوند. 
    اما تک تک برگشتی ها در نظر گرفته نمیشوند، بنابراین لازم است هنگامی که بعداً برگشتیهای جدید میرسند قانونهای جدیدی افزوده شود.',
  'Generate Bounce Rules' => 'ساختن قانونهای برگشت',
  'Check Current Bounce Rules' => 'بررسی فانوننهای برگشت فعلی',
);

?>
