<?php
$lan = array (
    'NoAttr' => 'چنین ویژگی وجود نداردNo such attribute:',
    'AddNew' => 'افزودن جدید',
    'SureToDeleteAll' => 'آیا مطمئنید میخواهید همه رکوردها را حذف کنید؟',
    'DelAll' => 'حذف همه',
    'ReplaceAllWith' => 'به جای آن میتوانید همه مقادیر را با دیگری جایگزین کنید:',
    'ReplaceWith' => 'جایگزین با',
    'TooManyToList' => '* تعداد برای نمایش خیلی زیاد است، وابستگی کلی:',
    'TooManyErrors' => '* تعداد خطاها خیلی زیاد است، در حال خارج شدن',
    'Delete' => 'حذف',
    'Default' => '(پیشفرض)',
    'changeorder' => 'تغییر ترتیب',
    'cannotdelete' => 'نمیتوانم حذف کنم ',
    'dependentrecords' => 'رکورد(های( زیر به این مقدار وابسته اند<br />رکورد(ها) را به روز کنید تا به این مقدار ویژگی وابسته نباشند و دوباره سعی کنید',
    'addnew' => 'افزودن جدید',
    'oneperline' => 'هر خط یکی',
    'deleteandreplace' => 'حذف و جایگزینی',

);
?>