<?php 
$lan = array(
  "BackEditTemp" => "بازگشت به ویرایش الگو",
  "TempSample" => '
پادشاهى هوشنگ چهل سال بود 

پس از گيومرت، هوشنگ خردمند و دادگر تاج بر سر نهاد«2»و چهل سال پادشاهى بكرد. چون بر تخت شاهى بنشست، گفت: من پادشاه هفت كشورم كه‏
به فرمان يزدان پيروزگر، اينك كمر به داد و دهش مى‏بندم. پس از آن گيتى را يك سره آباد ساخت و داد بگسترد. نخست با دانش خود، آهن را از سنگ بيرون آورد.
پس آنگاه با شناختن آهن بود كه پيشه آهنگرى بنياد نهاد و بدان، تبر و ارّه و تيشه ساخته گشت.
پس از آن چاره آب كرد و آبها را با ساختن جويها، از دريا به دشت‏
آورد و رنج مردم را كوتاه ساخت. چون آگاهى مردم افزون گشت، پس كشاورزى پديد آمد و هر كسى خوراك خويش، از كشاورزى بيآورد و با آغاز كشاورزى بود كه هر كسى سامان خويش بشناخت و يكجا نشين گشت. پيشتر از آن كه اين كارها كرده شود، خوردنيها، تنها از ميوه‏ها و پوشاك مردم تنها از برگ درختان بود.

بنياد نهادن جشن سده‏

آيين و كيش نياكان، خداپرستى بود و آتش به نزد ايشان همچون پيشگاه بود در نزد تازيان. در آن زمان، آتش از دل سنگ پديد آمد و گيتى را روشنى گسترانيد.
روزى شاه گيتى با تنى چند از بزرگان به كوه گذر كرد كه ناگهان از دور چيزى دراز و سياه‏رنگ و تيز رو پديدار گشت كه دو چشمش همچون دو چشمه خون بود و از دودِ دهانش، گيتى تيره و تار شده بود. هوشنگ چون آن بديد، سنگى به دست گرفت و آن را به نيروى كيانى بسوى آن مار پرتاب كرد. ليكن مار بگريخت و آن سنگ كوچك به سنگ بزرگى خورد و هر دو سنگ شكسته شدند و از آن دو فروغى پديدار گشت. آن مار كشته نشد و ليكن از آن سنگ، آتش پديد آمد. پس هوشنگ از اين كه پروردگار آفريننده گيهان، چنين فروغى به او ارزانى داشت، به درگاه او نيايش بسيار كرد و يزدان را آفرين خواند و گفت: اين فروغى ايزدى است كه بايد از آن پاسدارى‏               
گردد.«1»پس چون شب فرا رسيد، هوشنگ با مردم، آتشى به بزرگى كوهى برافروخت و جشنى بپا كرد و به باده نوشى پرداخت و نام آن جشن فرخنده را سده نهاد. و بدين سان اين جشن سده از هوشنگ به يادگار ماند. آنگاه هوشنگ به آباد كردن گيتى پرداخت و از همين روست كه نام او در گيتى به نيكى بماند. از ميان جانوران، گاو و خر و گوسپند را جدا كرد و آنان را براى كشاورزى بكار گرفت و
مردمان را گفت: اين جانوران را جفت جفت نگاهداريد و با ايشان كِشت كنيد و خوراك خويشتن را، خود پروريد. آنگاه از جانورانى دونده، آنهايى را كه موهايى زيبا و گرم و نرم داشتند همچون سنجاب و آس و روباه و سمور بكشت و پوست ايشان را بِكَنْد و 
بدين گونه از چرم آنها، براى مردم بالاپوش فراهم آورد.
 
آزمودن فريدون پسران خود را

چون فريدون از بازگشت پسرانش آگه شد خواست تا از دل ايشان آگه شود و ايشان را بيآزمايد. پس او كه جادو مى‏دانست، بسان يك اژدها كه شير هم ياراى رهايى از چنگ او را نداشت، جوشان و خروشان، آنسان كه از دهانش آتش بيرون مى‏آمد به سر راه پسران شتافت و برابر پسر بزرگترش ايستاد. پسر بزرگتر كه او را ديد گفت: مرد خردمند با اژدها در نمى‏آويزد. اين بگفت و به شتاب ازو بگريخت. آنگاه فريدون در همان نمود اژدها به سوى برادر ميانه رفت. پسر ميانه چون او را بديد، كمان را به زه كرد و گفت: اگر بايد جنگيد، چه ميان شير دمنده و مرد جنگى؟ در همان هنگام پسر كوچكتر به نزد ايشان رسيد و چون اژدها را بديد، برخروشيد و به او گفت: از پيش ما برو، كه تو همچون نهنگى هستى كه نبايد در راه شيران رود.
اينك اگر نام شاه آفريدون به گوش تو رسيده است، هرگز بدين سان مكوش، چه ما هر سه پسران اوييم و هر سه جنگاور. پس يا به راه ديگرى شو، يا اين كه به جنگت مى‏شتابم. چون فريدون فرّخ ، سخنان و هنرهاى ايشان بشنيد و بديد، ناپديد گشت.
آنگاه در نمود راستين خود يعنى بسان پدر ايشان، چنانكه سزاوار بود با كوس و پيلان مست و با گرز گاوسار در دست و بزرگان لشگر در پشت سر به پيشواز پسرانش شتافت. پسران كه چنين ديدند پياده گشتند و بر خاك بوسه دادند. فريدون دست ايشان را بگرفت و به اندازه بنواختشان.
چون به كاخ رسيدند، فريدون به گوشه‏اى رفت و خداى را سپاس بسيار گفت كه هر چه از نيك و بد روزگار ديد، ازو بود. آنگاه سه پسر خود را بخواند و بر تخت نشاند و ايشان را گفت: آن اژدهاى دژم كه مى‏خواست گيتى را با دَم خود بسوزاند،
من بودم كه مى‏خواستم شما را بيآزمايم و چون آزمودم، شاد گشتم، اكنون گاهِ آن فرا رسيد كه چنانكه بايسته است، بر شمايان، نامى نهم. پس تو كه پسر بزرگتر هستى، نامت سلم باشد كه تندرست از چنگ نهنگ بيرون آمدى و در گريز، درنگى نكردى و براستى دلاورى كه از پيل و شير نيانديشد، بايد او را بجاى دلير، ديوانه خوانْد . اما پسر ميانه را كه از همان آغاز دليرى كرد بايد تور ناميد كه همچون شير دليرى بود كه پيل نيز نتوانست او را به زير آوَرَد . و پسر كوچكتر كه هم خردمند و هم جنگى، هم با شتاب و هم با درنگ است و هوشيارانه راه ميانه را برگزيد، ايرج نامش باد كه سزاوار اوست. و اكنون زمان آن شد تا نام اين پرى چهرگان تازى را
بگذارم. پس فريدون، زن سلم را آرزو، زن تور را ماه آزاده خوى و زن ايرج را سهى ناميد. آنگاه خواست تا اختر ايشان را ببيند و از آينده ايشان آگاه گردد. پس در آنچه كه اختر شناسان از آينده سلم و تور و ايرج بديده و بنوشته بودند، نگريست. اختر سلم، نشان از برجيس و كمان داشت. اختر تور، شير بود. اما اختر ايرج، خرچنگ بود كه نشان از آشوب و جنگ بود. فريدون چون آن بديد، اندوهگين گشت و آهى كشيد، كه سپهر را به ايرج برآشفته و ناسازگار ديد.
');
?>
