<?php
$lan = array (
  'BackEditTemp' => '回到模板编辑',
  'TempSample' => '真糗，在书店门口打了半天的资料，因为忘记存档就付诸流水了；这是第二次开头，希望别忘记太多。

由于许多管理学理论都在没有电脑与网路的时代发明，当代的管理学大师也不会为了我所面临的问题写书，更别提许许多多我请不起、也不见得认同的顾问，毕竟我还小。因此我决定停止翻书了，放下老师教的东西(应该说忘了吧...)，诚实面对自己遇到的问题，试着找出合适的解决方桉。

从\"顾问成功的秘密\"( http://www.cite.com.tw/product_info.php?products_id=9394 )一书，我认同大部分的答桉，在问题提出前就存在于发问者的脑中，只是大部份发问者都无法跳脱自己的立场，或是不敢下决定；从\"重新想像\"( http://www.bookzone.com.tw/event/CB311/index.asp )一书，我认同现在许多过去深信不已的事情，现在都需要重新检验或打破。我是个非常厌恶效率不彰的人，因此希望能够找到一个符合实际需求的答桉，更希望能够让人动起来。

我希望能够发展以开放原始码为基础的商务模式，也就是朝服务导向发展。这样的方向，从GOOGLE( http://www.google.com.tw/ )现在的成果中看到了些信心，也从IKEA( http://www.ikea.com.tw/ )的卖场中发现，消费者体验带给人们的影响，远超过夸大不实的行销手法；即使后者往往有着比较好的成本、效益比，我还是希望能够踏实些。

朝着这个方向走，我需要更多人的帮助；而如何能够让更多人的力量朝这个方向推进？也许真有些朋友像我这样傻，有着一两个念头就会彻夜难眠，凭着一点点理想就 \"撩落去\"；但是这样的人毕竟太少了，而且光靠这些人，只会让这件事情看来像是遥遥欲墬的象牙塔，当然不够！还要有更多的人才行。这样的人，可能每天沉溺在线上游戏与即时通讯之中，无法从现实中获得足够的认同；这样的人，可能每天忙于事业、家庭等压力，除非有机会病倒，否则很难思考什麽人生价值之类的问题；这样的人，可能活在一个又一个的小圈子中，每天鑽研少数人看的懂得技术、理论，出口闭口都异于常人而不自知。(我也许也算是第三种人吧)

线上游戏真的很迷人吧，我在过去网路聊天盛行的时代也有着同样的感受，当时每天只要有机会打开电脑、连上网路，我的暱称就一定会出现在线上聊天室中；感谢那些让我发现自己自作多情的女性网友，感谢品质越来越差的聊天室，我因此有机会戒了这个瘾，也对后来更多的诱惑产生抗体。但是，我如何让身陷其中的力量能够转而支持自己的方向？抱歉，只能够等，我也只愿意等；等到这样的朋友发现自己因此忽略了现实生活，等到这样的朋友认同这个方向，或者，线上游戏公司突然都消失？别闹了。 :)

当然不能够只是期待推力，要想法子让这个方向对他们而言具有吸引力。这样的朋友大多较年轻，有很多的机会变成忙于生活的人们；所以先在他们的下一个阶段设下圈套！嘿嘿...

成天忙于事业、家庭的朋友，很直接的问题就是经济压力；钱的问题好解决，可惜我也没有钱...。我的想法是，设置一个类似\"开放原始码商业协会\"的组织，制定游戏规则来让这个社群能够活下去；我很有把握的是，一定会有想要鑽研规则漏洞的朋友，毕竟这是台湾闻名世界的条件之一。但是规则要想一开始就没有漏洞，那也是不切实际的想法；先要有人动手做、正视面临的任何问题、挽回失去的信心，然后才有蓬勃发展的可能。

我不打算回答大量\"你凭什麽...\"之类的问题，虽然我说过要放下老师教的东西，但是有一句话回应问题最方便，那就是\"Action speaks louder than words\"。

对于那些希望在技术领域持续精进的朋友，也就是下一个GOOGLE可能的创办人，或者是因为无私的牺牲奉献而留名青史的伟人，我相信自己经常是被这些朋友嗤之以鼻的对象；我想说的很单纯，如果有机会发现这麽做没那麽糟时，千万别把跟我或我们之间的争执放在心上；就事论事罢了，立场不同、答桉也就自然不同。

其实，这篇文章的重点从下面才开始，感谢您那麽用心的看了我的开场白...。

\"开放原始码商业协会\"这样的组织需要什麽样的游戏规则？开宗明义，就是要开放原始码。而在GPL( http://www.slat.org/project/legal/GNU_GPL_Chinese )的定义中，如果我没有着太多的误解，那麽也许该说是对您的客户开放原始码；除非您透过GPL发布的软体公开让人下载，否则没有必要去理会那些莫名奇妙想索取原始码的朋友。

但是GPL并不是开放原始码唯一的途径，在开放原始码协会( http://www.opensource.org/ )中通过了许多我们可能从未看过的授权方式，伟大的微软公司对于特定对象也有开放原始码的行为( http://taiwan.cnet.com/news/software/0,2000064574,20064270,00.htm )，我们需要一个比较明确、通用的定义。我曾提出这样的定义：

「当商品的标的为软体时，任何客户有权(无偿或合理价格)取得软体原始码，散佈、修改与否则依各公司规定；当商品标的为硬体时，客户有权得知硬体所附带之各种软体/韧体授权方式等必要资讯。合理价格的定义是不超过软体或服务本身交易价格的 2 倍，而任何商务发展均不得违反原始软体的授权规定。」

也许可以用来起个头，等候大家的评论。

至于做法，就以台湾PHP联盟( http://twpug.net/ )想要做的事情当作例子。从一个愿意支援开放原始码软体本地化(也就是翻译或自行设计)的朋友开始，他会将与软体有关的资讯带给大家；因此如果有商务需求时，自然会推荐这个热心的朋友。这个热心的朋友很有可能来自学术界，因此商务需求也许会导向他所推荐的对象；从这裡开始就可以区分成三个角色，一个是商务性支援的联繫人，一个是学术性资源的联繫人，另外一个则是横跨两个领域的角色，这三个角色都对于该软体有相当的贡献。

三个和尚没水喝，因此在这边需要多一点着墨。当专桉的本地化只有一个人支援时，这个人理所当然扮演了三个角色；而要一个人兼三个角色或另外指定人来协助，就由开始的人决定。三个角色都各只能有一个人担任，其他热心参与贡献且希望参与核心运作的朋友则可以隶属于\"意见小组\"，也就是具有重大决议的提桉与投票权。当冲突形成时，就是透过这群人自行协商来取得共识(投票？)；如果争议无法解决，则由协会仲裁。

那麽协会扮演的角色为何？很简单，就是凝聚通用性资讯、资源与担任沟通的桥樑。

人的定义为何？那就是法人或自然人(还有其他的吗？)。

接着要考虑的是依存关係的部分，像是模组、佈景、元件、物件、...等等基于于同一个软体所存在的资源；如果有程式设计概念的朋友，麻烦使用递迴处理...。简单的说，就是把协会对于软体专桉的角色，换成了软体专桉对于模组的角色；如果还有更下层的关係，以此类推。但是有个特别的地方是，如果模组本地化维护者不愿意隶属于软体专桉下，那麽也可以直接对应到协会；而如果连对协会都不满，这个专有名词叫做无限迴圈，俗话说叫做无解，那就只能麻烦自己成立一个协会了。不过有一个冲突情形，那就是衍生版本(FORK)；如果有朋友希望支援衍生版本，那麽就不能够隶属于原本的专桉之下。

而上面这些东西当然不是说说就算了，任何重大决议都要透过书面协议；我没有写的像法条一样，原因是要先讨论，也让大家了解这些想法。真的有机会成型时，希望能够有法律领域的专业先进指导。

额外一提，以商业协会名义存在的目的只有一个，那就是更大的包容；非营利组织经常无法包容营利行为，这不是我们所乐见的。',

);
?>