<?php

$lan = array(
  'List Bounce Rules' => 'バウンスルールのリスト',
  'rulesexistwarning' => 'システムに既にバウンスルールが定義されています。
    存在するルールと干渉するかもしれないので、新規ルールの生成には十分に注意してください。',
  'norulesyet' => '現在、ルールが定義されていません。
    既存のバウンスメールから自動的にルールを生成するために、"バウンスルールの生成"をクリックすることができます。
    ルールを確認して、必要であればアクティベートしてください。
    しかしながら、単一のバウンスメールごとにみつけませんので、新しいバウンスメールが届く度に新規ルールを追加する必要があります。',
  'Generate Bounce Rules' => 'バウンスルールの生成',
  'Check Current Bounce Rules' => '現在のバウンスルールをチェックする',

 # Add 日本PHPLISTユーザグループ 2006.09.28
  'view bounces per list' => 'リストごとのバウンスを閲覧する',
);

?>
