<?php
$lan = array (
  'BackEditTemp' => '回到樣板編輯',
  'TempSample' => '真糗，在書店門口打了半天的資料，因為忘記存檔就付諸流水了；這是第二次開頭，希望別忘記太多。

由於許多管理學理論都在沒有電腦與網路的時代發明，當代的管理學大師也不會為了我所面臨的問題寫書，更別提許許多多我請不起、也不見得認同的顧問，畢竟我還小。因此我決定停止翻書了，放下老師教的東西(應該說忘了吧...)，誠實面對自己遇到的問題，試著找出合適的解決方案。

從\"顧問成功的秘密\"( http://www.cite.com.tw/product_info.php?products_id=9394 )一書，我認同大部分的答案，在問題提出前就存在於發問者的腦中，只是大部份發問者都無法跳脫自己的立場，或是不敢下決定；從\"重新想像\"( http://www.bookzone.com.tw/event/CB311/index.asp )一書，我認同現在許多過去深信不已的事情，現在都需要重新檢驗或打破。我是個非常厭惡效率不彰的人，因此希望能夠找到一個符合實際需求的答案，更希望能夠讓人動起來。

我希望能夠發展以開放原始碼為基礎的商務模式，也就是朝服務導向發展。這樣的方向，從GOOGLE( http://www.google.com.tw/ )現在的成果中看到了些信心，也從IKEA( http://www.ikea.com.tw/ )的賣場中發現，消費者體驗帶給人們的影響，遠超過誇大不實的行銷手法；即使後者往往有著比較好的成本、效益比，我還是希望能夠踏實些。

朝著這個方向走，我需要更多人的幫助；而如何能夠讓更多人的力量朝這個方向推進？也許真有些朋友像我這樣傻，有著一兩個念頭就會徹夜難眠，憑著一點點理想就 \"撩落去\"；但是這樣的人畢竟太少了，而且光靠這些人，只會讓這件事情看來像是遙遙欲墬的象牙塔，當然不夠！還要有更多的人才行。這樣的人，可能每天沉溺在線上遊戲與即時通訊之中，無法從現實中獲得足夠的認同；這樣的人，可能每天忙於事業、家庭等壓力，除非有機會病倒，否則很難思考什麼人生價值之類的問題；這樣的人，可能活在一個又一個的小圈子中，每天鑽研少數人看的懂得技術、理論，出口閉口都異於常人而不自知。(我也許也算是第三種人吧)

線上遊戲真的很迷人吧，我在過去網路聊天盛行的時代也有著同樣的感受，當時每天只要有機會打開電腦、連上網路，我的暱稱就一定會出現在線上聊天室中；感謝那些讓我發現自己自作多情的女性網友，感謝品質越來越差的聊天室，我因此有機會戒了這個癮，也對後來更多的誘惑產生抗體。但是，我如何讓身陷其中的力量能夠轉而支持自己的方向？抱歉，只能夠等，我也只願意等；等到這樣的朋友發現自己因此忽略了現實生活，等到這樣的朋友認同這個方向，或者，線上遊戲公司突然都消失？別鬧了。 :)

當然不能夠只是期待推力，要想法子讓這個方向對他們而言具有吸引力。這樣的朋友大多較年輕，有很多的機會變成忙於生活的人們；所以先在他們的下一個階段設下圈套！嘿嘿...

成天忙於事業、家庭的朋友，很直接的問題就是經濟壓力；錢的問題好解決，可惜我也沒有錢...。我的想法是，設置一個類似\"開放原始碼商業協會\"的組織，制定遊戲規則來讓這個社群能夠活下去；我很有把握的是，一定會有想要鑽研規則漏洞的朋友，畢竟這是台灣聞名世界的條件之一。但是規則要想一開始就沒有漏洞，那也是不切實際的想法；先要有人動手做、正視面臨的任何問題、挽回失去的信心，然後才有蓬勃發展的可能。

我不打算回答大量\"你憑什麼...\"之類的問題，雖然我說過要放下老師教的東西，但是有一句話回應問題最方便，那就是\"Action speaks louder than words\"。

對於那些希望在技術領域持續精進的朋友，也就是下一個GOOGLE可能的創辦人，或者是因為無私的犧牲奉獻而留名青史的偉人，我相信自己經常是被這些朋友嗤之以鼻的對象；我想說的很單純，如果有機會發現這麼做沒那麼糟時，千萬別把跟我或我們之間的爭執放在心上；就事論事罷了，立場不同、答案也就自然不同。

其實，這篇文章的重點從下面才開始，感謝您那麼用心的看了我的開場白...。

\"開放原始碼商業協會\"這樣的組織需要什麼樣的遊戲規則？開宗明義，就是要開放原始碼。而在GPL( http://www.slat.org/project/legal/GNU_GPL_Chinese )的定義中，如果我沒有著太多的誤解，那麼也許該說是對您的客戶開放原始碼；除非您透過GPL發布的軟體公開讓人下載，否則沒有必要去理會那些莫名奇妙想索取原始碼的朋友。

但是GPL並不是開放原始碼唯一的途徑，在開放原始碼協會( http://www.opensource.org/ )中通過了許多我們可能從未看過的授權方式，偉大的微軟公司對於特定對象也有開放原始碼的行為( http://taiwan.cnet.com/news/software/0,2000064574,20064270,00.htm )，我們需要一個比較明確、通用的定義。我曾提出這樣的定義：

「當商品的標的為軟體時，任何客戶有權(無償或合理價格)取得軟體原始碼，散佈、修改與否則依各公司規定；當商品標的為硬體時，客戶有權得知硬體所附帶之各種軟體/韌體授權方式等必要資訊。合理價格的定義是不超過軟體或服務本身交易價格的 2 倍，而任何商務發展均不得違反原始軟體的授權規定。」

也許可以用來起個頭，等候大家的評論。

至於做法，就以台灣PHP聯盟( http://twpug.net/ )想要做的事情當作例子。從一個願意支援開放原始碼軟體本地化(也就是翻譯或自行設計)的朋友開始，他會將與軟體有關的資訊帶給大家；因此如果有商務需求時，自然會推薦這個熱心的朋友。這個熱心的朋友很有可能來自學術界，因此商務需求也許會導向他所推薦的對象；從這裡開始就可以區分成三個角色，一個是商務性支援的聯繫人，一個是學術性資源的聯繫人，另外一個則是橫跨兩個領域的角色，這三個角色都對於該軟體有相當的貢獻。

三個和尚沒水喝，因此在這邊需要多一點著墨。當專案的本地化只有一個人支援時，這個人理所當然扮演了三個角色；而要一個人兼三個角色或另外指定人來協助，就由開始的人決定。三個角色都各只能有一個人擔任，其他熱心參與貢獻且希望參與核心運作的朋友則可以隸屬於\"意見小組\"，也就是具有重大決議的提案與投票權。當衝突形成時，就是透過這群人自行協商來取得共識(投票？)；如果爭議無法解決，則由協會仲裁。

那麼協會扮演的角色為何？很簡單，就是凝聚通用性資訊、資源與擔任溝通的橋樑。

人的定義為何？那就是法人或自然人(還有其他的嗎？)。

接著要考慮的是依存關係的部分，像是模組、佈景、元件、物件、...等等基於於同一個軟體所存在的資源；如果有程式設計概念的朋友，麻煩使用遞迴處理...。簡單的說，就是把協會對於軟體專案的角色，換成了軟體專案對於模組的角色；如果還有更下層的關係，以此類推。但是有個特別的地方是，如果模組本地化維護者不願意隸屬於軟體專案下，那麼也可以直接對應到協會；而如果連對協會都不滿，這個專有名詞叫做無限迴圈，俗話說叫做無解，那就只能麻煩自己成立一個協會了。不過有一個衝突情形，那就是衍生版本(FORK)；如果有朋友希望支援衍生版本，那麼就不能夠隸屬於原本的專案之下。

而上面這些東西當然不是說說就算了，任何重大決議都要透過書面協議；我沒有寫的像法條一樣，原因是要先討論，也讓大家了解這些想法。真的有機會成型時，希望能夠有法律領域的專業先進指導。

額外一提，以商業協會名義存在的目的只有一個，那就是更大的包容；非營利組織經常無法包容營利行為，這不是我們所樂見的。',

);
?>